package org.study.bootcamp.interview_practice;

//
//                                                  ┌────────────────┐
//                                                  │  Iterable [I]  │
//                                                  │  Итерируемый   │
//                                                  │  / Обходимый   │
//                                                  └────────▲───────┘
//                                                           │
//                                                           │  extends
//                                                           │ расширяет
//                                                           │
//                                                  ┌────────────────┐
//                     ┌─────────────────────────── │ Collection [I] │ ────────────────────────────┐
//                     │                            │ Коллекция      │                             │
//                     │                            └────────▲───────┘                             │
//                     │                                     │                                     │
//                     │  extends                            │  extends                   extends  │
//                     │ расширяет                           │ расширяет                 расширяет │
//                     │                                     │                                     │
//            ┌────────────────┐                    ┌────────────────┐                    ┌────────────────┐
//      ┌─ ─ ─│   Queue [I]    │               ┌─ ─ │    List [I]    │ ─ ─┐               │    Set [I]     │
//      │     │   Очередь      │                    │    Список      │                    │    Множество   │
//      │     └────────▲───────┘               │    └────────────────┘    │               └────────────────┘
//                     │                       │                          │
//      │              │  extends                implements    implements
//      │              │ расширяет             │ реализует      реализует │
//                     │                       │                          │
//      │              │      implements
//      │              │       реализует       │                          │
//                     │    ┌─ ─ ─  ─ ─┐       │                          │
//      │     ┌────────────────┐      ┌────────────────┐        ┌────────────────┐
//      │     │   Deque [I]    │      │ LinkedList [C] │        │ ArrayList [C]  │
//            │   Двусторонняя │      │ Связный список │        │                │
//      │     │   очередь      │      │                │        │                │
//      │     └────────────────┘ ┐    └────────────────┘        └────────────────┘
//
//      │ implements             │ implements
//      │ реализует              │  реализует
//
//      │                        │
//      │                        │
// ┌─────────────────┐  ┌─────────────────┐
// │PriorityQueue [C]│  │ ArrayDeque [C]  │
// │Очередь с        │  │                 │
// │приоритетом      │  │                 │
// └─────────────────┘  └─────────────────┘
//

public class _09_0_CollectionsFramework {
}
