package org.study.bootcamp.interview_practice;

//                      Иерархия Java Collections Framework: интерфейсы и стандартные реализации
//
//                                                  ┌────────────────┐
//                                                  │  Iterable [I]  │
//                                                  │  Итерируемый   │
//                                                  │  / Обходимый   │
//                                                  └────────▲───────┘
//                                                           │
//                                                           │  extends
//                                                           │ расширяет
//                                                           │
//                                                  ┌────────────────┐
//                     ┌───────────────────────────▶│ Collection [I] │◀────────────────────────────┐
//                     │                            │ Коллекция      │                             │
//                     │                            └────────▲───────┘                             │
//                     │                                     │                                     │
//                     │  extends                            │  extends                   extends  │
//                     │ расширяет                           │ расширяет                 расширяет │
//                     │                                     │                                     │
//            ┌────────────────┐                    ┌────────────────┐                    ┌────────────────┐
//      ┌─ ─ ▶│   Queue [I]    │               ┌─ ─▶│    List [I]    │◀─ ─┐             ┌▶│    Set [I]     │◀┐
//      │     │   Очередь      │                    │    Список      │                    │    Множество   │ │
//            └────────▲───────┘               │    └────────────────┘    │             │ └────────────────┘ │
//      │              │                                                                │                    │
//      │              │  extends              │ implements    implements │               implements         │  extends
//                     │ расширяет             │ реализует      реализует │             │ реализует          │ расширяет
//      │              │                                                                │                    │
//      │              │                       │                          │    ┌────────────────┐   ┌────────────────┐
//                     │                       │                          │    │  HashSet [C]   │   │ SortedSet [I]  │
//      │              │                                                       │  Хэш-множество │   │ Отсортированное│
//      │              │                       │                          │    │                │   │ множество      │
//                     │                       │                          │    └────────▲───────┘   └────────▲───────┘
//      │              │                                                                │                    │
//      │              │                       │                          │             │  extends           │  extends
//                     │                       │                          │             │ расширяет          │ расширяет
//      │              │                                                                │                    │
//      │              │                       │                          │    ┌─────────────────┐  ┌─────────────────┐
//                     │      implements       │                          │    │LinkedHashSet [C]│  │NavigableSet [I] │
//      │              │       реализует                                       │Хэш-множество с  │  │Навигационное    │
//      │              │                       │                          │    │порядком вставки │  │множество        │
//                     │    ┌─ ─ ─  ─ ─┐       │                          │    └─────────────────┘  └────────▲────────┘
//      │     ┌─────────────▼──┐      ┌────────────────┐        ┌────────────────┐
//      │     │   Deque [I]    │      │ LinkedList [C] │        │ ArrayList [C]  │                implements │
//            │   Двусторонняя │      │ Связный        │        │ Массивный      │                 реализует
//      │     │   очередь      │      │ список         │        │ список         │                           │
//      │     └────────────────┘◀┐    └────────────────┘        └────────────────┘                  ┌─────────────────┐
//                                                                                                  │   TreeSet [C]   │
//      │                        │                                                                  │   Множество     │
//        implements               implements                                                       │   на дереве     │
//      │ реализует              │  реализует                                                       └─────────────────┘
//
//      │                        │
//      │                        │
// ┌─────────────────┐  ┌─────────────────┐
// │PriorityQueue [C]│  │ ArrayDeque [C]  │
// │Приоритетная     │  │ Двусторонняя    │
// │очередь          │  │ очередь на      │
// │                 │  │ массиве         │
// └─────────────────┘  └─────────────────┘
//

/**
 * КЛАСС ДЛЯ ДЕМОНСТРАЦИИ КОЛЛЕКЦИЙ В JAVA И ИХ ОСОБЕННОСТЕЙ
 *
 * @author Sergey
 */
public class _09_0_CollectionsFramework {
}
